a
aa
aai
aaku
aamu
aano
aanu
aaru
aati
aau
afi
aga
agaaga
agaagata
agaga
agah
agahe
aganira
agapo
agataiahi
age
agi
agiagi
agoago
aha
ahaa
ahan
ahani
ahara
ahe
ahekai
ahi
ahiahi
ahimahima
ahirega
ahiri
ahiue
aho
ahu
ahuru
ai
aiga
aito
aka
akaaka
akatau
akau
akaue
akauve
akavega
ake
aki
akikuku
ako
akoako
aku
akuaku
akui
alu
ama
amiami
amimi
amo
amoamo
amoga
amohino
amuti
amuxa
an
ana
anaaga
anakeanake
anakihorou
anako
ananake
ane
anira
anua
anuanu
anuga
anuhe
ao
aoevai
apa
apai
apapa
apauoko
api
apo
apoera
apogara
ara
araara
arahu
aranga
arapeka
araro
ararua
are
arero
ariga
ariiki
ariikie
ariki
arikipaka
arina
ariugarehe
aro
aroha
arua
aruaru
aruarua
aruke
aruki
arurua
ata
ataata
atakai
atara
atariki
atarungi
ate
atea
ateate
ati
atimo
atimoterae
ato
atu
atua
atura
ature
atuxa
au
aua
auahi
auau
aue
augingieai
auhopu
auke
aukia
aumoa
aura
auraxe
auroaroa
aue
auxau
ava
avaava
avaga
avahata
avahi
avahinua
avai
avanga
ave
aveave
avia
axa
axea
axu
chiu
e
e...e
ea
eaa
eae
eaha
eau
eepe
eete
eeti
efi
ego
egoego
eha
ehu
ehuua
ei
eiri
ekaeka
eke
ekieki
eko
emu
eo
eoeo
epa
epe
epuoko
era
eraa
erua
etahi
ete
eve
evea
eveerua
exeo
fahiti
forani
ga
gaaha
gaatu
gaegae
gaehe
gaeke
gaexi
gaexiexi
gaga
gagana
gagata
gagi
gaha
gaio
gana
gao
gaoho
garahu
garara
garepe
gareperepe
garo
garoxa
garu
garuhoa
garuparupa
garuru
garuxa
gatu
gatupuna
gau
gaugau
gaukauha
gaxegaxe
ge
gege
geha
geo
geti
geu
gexi
gita
gixigixi
gixogixo
goa
goe
gogo
gogoro
gogorovaxa
gohu
gorigori
gorogoro
goto
goxe
goxigoxi
gu
gugugugu
gugumata
guhiguhi
guhu
guhuhahatea
guregure
guruhara
gutu
gutugutu
h
ha
haa
haaati
haahaarua
haaki
haamatua
haath
haati
hae
haehae
haere
haga
hagahaga
hagai
hagana
hage
hagehage
hagu
haguhagu
hagupotu
haha
hahaa
hahae
hahaga
hahaki
hahamea
hahari
haharua
hahata
hahati
hahatu
hahau
hahave
hahaxo
hahaxu
hahehahe
hahei
hahi
hahine
hahinie
hahiue
haho
hahuhahu
hai
haiara
haieka
hainu
haitau
haiuge
haka
hakaagiagi
hakaago
hakaahiahi
hakaamo
hakaara
hakaaraga
hakaariki
hakaaroha
hakaata
hakaatu
hakaatuga
hakaau
hakaaxu
hakaeepe
hakaeete
hakaehu
hakaeiei
hakaeke
hakaeki
hakaemu
hakaepa
hakaere
hakagaro
hakagau
hakagexigexi
hakagogorovaxa
hakagoto
hakahaere
hakahahata
hakahana
hakahanohano
hakahaxa
hakaheguhegu
hakahehe
hakahei
hakahepo
hakahere
hakaheu
hakaheuru
hakahihi
hakahikohiko
hakahiku
hakahini
hakahiohio
hakahiri
hakahiria
hakahoki
hakahunu
hakairi
hakakaikai
hakamarui
hakanaganagana
hakanohoa
hakanui
hakaopa
hakapeka
hakarao
hakarava
hakari
hakarongo
hakatu
hakatupu
hakauga
hakaumi
hakavari
hakavirri
hakehetu
haki
hakukuti
hakurakura
hami
hamu
hamuhamu
han
hana
hanaga
hanau
hanga
hangaroa
hanihani
hanohano
hanuanuamea
hao
haoa
haohaoa
hapai
hapaki
hara
harahara
harakea
harara
haraxi
hare
harepepe
hariu
haro
harui
haruru
hata
hatataka
hatatiri
hatatu
hati
hatigo
hatipu
hatu
hatui
hatukai
hatuke
hatukuti
hatuna
hatunono
hatutire
hatuvoi
hau
haua
haugai
hauhau
hauhaxa
haumuumu
hauru
hauti
hauva
hava
havahava
have
havea
haveavea
haxa
haxahaxaroroa
haxamore
haxaro
haxi
haxiga
haxu
haxuxu
he
hee
hegahega
heguhegu
hehe
hehega
hehehehe
heheu
hehexi
hehun
hehuu
hei
heima
heipara
heipaxa
heire
heka
hekaheka
heke
hen
henua
henuaa
hepeue
hepixi
hepo
heraherakitomea
herakiraki
here
herehere
hereka
herekereke
herexu
heriki
heroe
herohero
heru
heruheru
herunga
heruru
heta
hetiki
hetomu
hetu
hetun
hetuxu
heu
heuheu
heuna
heuru
heva
hevehoki
hexihexi
hi
hia
hiahia
hiero
higa
hihi
hihihihi
hihohihokiteturu
hika
hiki
hikipuku
hiko
hikohiko
hiku
hikua
hikue
hikukioxe
hina
hinaoioi
hinarere
hine
hini
hinihini
hinua
hio
hiohio
hipa
hipu
hiri
hiritoke
hiro
hiru
hiti
hitirau
hito
hitu
hiu
hiuakuhara
hiuaoio
hiuaoioi
hiuapopoia
hiuitirerire
hiva
hivo
ho
hoa
hoake
hoato
hoatumatua
hoe
hoea
hogaxa
hogi
hohio
hohoni
hohora
hoi
hoke
hoki
hoko
hokohuki
homo
hon
honga
honiti
hono
honu
honui
hooku
hoona
hope
hopohopo
hopu
hopua
hopue
hora
horaura
hore
horehore
horeko
horihori
horo
horoa
horou
horoxi
hotake
hoto
hotuiti
hou
houa
houga
hounga
hove
hoxo
hoxou
hu
hua
huaai
huahua
huataru
hue
huehue
huga
hugahuga
hugamoa
hugaru
hugavai
huha
huhatu
huhu
huhure
huhuti
huira
huiramata
huirauiariga
huka
hukahuka
huki
hukia
hukiga
humu
humutoti
hun
hune
hunoga
hunue
hupe
hupehue
hupexe
hura
hurahura
hurehure
huri
hurihuri
huru
huruan
huruhuru
huti
i
ia
igoa[igoa]
igoigo
ihe
ihi
ihiihi
iho
ihoiho
ihu
iiiore
ika
iku
ikuvera
imu
ina
inaga
inage
inai
inaki
ingoa
inoino
ioio
ipu
ira
irakaka
iramuta
irapupue
iri
iriare
iringa
irira
irnuga
iru
irunga
it
ita
ite
item
iti
itiiti
itu
iuhi
iva
ivi
k
ka
kagore
kaha
kahakpiri
kahara
kaharta
kahi
kahihinga
kahihiua
kahii
kahinga
kahiria
kaho
kahonotake
kahu
kahua
kahuhinga
kahui
kahukahu
kai
kaiga
kaikai
kaiore
kairi
kairui
kaiugoh
kakae
kakaha
kakai
kakaka
kakapa
kakapura
kakara
kakarara
kakari
kakaro
kakau
kake
kakokako
kamau
kami
kamo
kamokamo
kan
kane
kanohotatataporo
kao
kapa
kapai
kapainga
kape
kapeu
kapipiri
kapitia
kappipiri
kapu
kapua
kapuapua
kapuhivi
kar
kara
karaga
karata
karatuxu
karava
karega
karekaavaikoe
karera
kari
karikau
kariritunarai
kariti
karo
karoga
karori
karu
karukaru
kata
katakata
katangi
katau
kate
kateapiairiroro
katei
katikati
katiki
kato
katu
kau
kauaha
kauatu
kauga
kauha
kauhaga
kauhagamore
kaukau
kaunuku
kaupa
kauteki
kauvaha
kauvaka
kauvaxe
kava
kavahaa
kavahia
kavakava
kave
kavei
kaxi
kaxikaxi
ke
kea
keakea
keho
kehu
keke
kekekeke
kekepu
kekeri
kekexe
kekexu
kena
kenu
keo
kepo
kere
kerega
kerekere
kerekeretu
kerereki
keri
kero
kete
ketekete
ketu
keu
keukeu
keva
kexi
kexo
kexokexo
ki
kia
kiakia
kiata
kiato
kihikehi
kihikihi
kiki
kikino
kikiri
kikiu
kiko
kimi
kina
kino
kinoga
kinokino
kio
kiogo
kiokio
kiora
kiore
kioxe
kiri
kirikirimiro
kiroke
kirokexa
kiroto
kite
kitoga
kiukiu
kiva
kivakiva
kixea
ko
koa
koake
koakoa
koau
koe
kohao
kohau
kohe
kohio
kohoa
kohu
koia
koiro
koka
kokekoke
koko
kokoe
kokogo
kokohu
kokokoko
kokoma
kokore
kokoro
kokoti
kokoxepo
komanirikomanara
komari
komo
kona
konakona
konakumi
konui
kope
kopeka
kopiri
kopirieuta
kopiro
kopu
kopuhia
kopuku
korapu
korare
koraxe
kore
koreha
koreva
kori
koria
koro
korohua
korohuxa
koroiti
koromaki
korotea
koroua
korua
korueiha
koruhi
kotaki
kote
kotetu
koti
kotia
kotikoti
kou
koue
koura
kovare
koviro
koxikoxi
ku
kua
kue
kugukugu
kuhane
kuhikia
kuki
kuku
kukumu
kukuro
kukurutou
kukuxo
kumara
kumaro
kume
kumi
kupega
kupu
kura
kuri
kuta
kutakuta
kutokuto
kutu
kuxikuxi
kuxukuxu
rari
m
ma
maa
maaga
maahu
maanau
maara
maari
maea
maemae
maga
magahaiga
magai
magamaga
magaro
mageo
magerogero
mago
magugu
magugugugu
magugupuro
mahaga
mahahine
mahaki
mahana
mahani
maharo
mahaui
maheo
mahera
mahia
mahiahia
mahigo
mahiha
mahimahi
mahina
mahoi
mahora
mahore
mahu
mahua
mahuna
mahute
mai
maiare
maika
maikuku
maikukumeamea
main
maitaki
maka
makemake
makenukenu
makere
maki
makituu
makixikixi
makohe
makona
makota
makoxi
makoxikoxi
makua
makupuna
maluta
mama
mamae
mamahi
mamahu
mamaia
mamairi
mamama
mamara
mamari
mamoe
man
mana
manana
mananatake
manaraga
manava
manavai
manaxu
manega
manege
mangaro
mangeongeo
mani
maniga
maniri
mano
manu
manunu
mao
maoa
maori
mapu
mara
marai
maraioturi
marama
maramara
maramarama
maranga
marao
mararia
mare
marego
mareni
marere
mari
maria
marikuru
marimoko
maripau
mariunga
maro
maroa
maroke
maru
maruaki
maruaua
maruhi
marumaru
mata
mataa
matagi
mataheune
matahiti
matai
matairi
matakao
matakeva
mataki
mataku
matamata
matamea
matamine
matangi
matapea
matapia
matapuku
matara
matariki
matariri
matatoxa
mataue
matavai
mataxu
mate
matega
matie
matini
matiro
mato
matone
matoru
matou
matu
matua
matuku
matuxa
matuxu
mau
maua
mauaira
mauga
maui
mauku
maunu
maxa
maxamaxa
maxea
maxeha
maxu
maxumaxuvanaga
me
mea
mei
meme
memememe
memere
meneheke
menehune
metua
mexe
migo
migoigoi
migomigo
mihaore
mihimihi
mimi
mimiro
minemine
mini
miramira
miritonu
miro
mirooone
mirunga
miti
mitimiti
mo
moa
moaha
moai
moamoa
moamoai
moana
moe
moega
moehara
moemata
moemoe
mohao
mohimohi
mohon
mohonga
mokirokiro
moko
mokomae
momoko
momomomo
momore
momotara
momotu
moni
monku
mono
more
morega
moremanga
mori
moroki
morore
motamota
mote
motiho
motu
motuha
motutakarua
mou
mouga
mouku
moumou
mua
muko
mukomuko
muku
mumae
mumu
munimuni
munniri
mura
muraki
mutamuta
muti
mutimuti
muxa
na
naeaki
naganaga
naginagi
nahe
nahoapu
nahonaho
nairo
nakinaki
nako
nakunaku
namunamu
nanagi
nanahua
nanai
nanaia
nanao
nanaxi
nanaxia
nanaxo
nanue
naonao
nape
naponapo
narinari
naroko
nate
nau
nauai
nauau
naunau
nave
naxa
naxinaxi
naxonaxo
neganega
nego
negonego
nehe
nehenehe
nehunehu
nei
neke
nekeneke
nemo
nene
neneku
nenera
nenexi
nero
neva
nexi
nexinexi
nga
ngaatu
ngaoreno
ngarava
ni
niau
niganiga
nihi
nihinihi
niho
nikiniko
ninaxa
nini
ninihi
nininini
niramai
nire
nironiro
niu
niuhitapakaxi
niuki
nivaniva
nixo
no
noa
noatu
nohi
noho
nohoe
nohoga
nohu
noi
nokinoki
noma
nono
nonoki
nonoma
nononono
nonoxi
noxi
nu
nua
nuahine
nui
nuika
nuinui
nuku
nukuramean
numia
o
oa
oaha
oaku
oga
ogahe
oge
ogeoge
ohe
ohi
ohio
ohipa
ohirohiro
oho
ohoga
ohu
ohumu
oi
oira
oka
okahega
okaoka
okioki
oko
okooko
omaoma
omo
omoaga
omoomo
omotahi
omotohi
ona
one
oneone
oniu
ono
onote
ooka
ooku
oona
oone
ootu
oou
opata
ope
opeope
opo
opoopo
or
ora
oraga
orei
ori
oro
orooro
oru
otae
otea
oti
otoroka
ou
ouku
ovakevake
oxi
oxioxi
oxo
oxoa
p
pa
paa
paahia
paake
pae
paega
paerega
pagahaxa
pahaka
pahera
pahoa
pahono
pahupahu
pahure
pahuuma
paiga
paihega
paihi
paina
paka
pakahera
pakakina
pakako
pakaohio
pakapaka
pakapakakina
pakeke
pakeopa
pakia
pakipaki
pakiroki
pakixu
pakoga
pakoxo
paku
pakuku
pakupaku
pana
pane
panga
pao
paoa
paoga
paohu
papa
papae
papaga
papagahaxa
papaki
papakina
papakona
papaku
papamea
papare
papatoa
para
parai
parapa
pararaha
parararahikutea
parare
pare
parehaoga
parehe
parei
parera
pari
parigi
paroko
paru
patara
pataxutaxu
patehe
patiri
pato
patu
patuki
pau
pauaroroko
paupau
pava
paxe
pe
pea
peapea
pegopego
pehe
pehea
pehiva
pehivaa
pei
peka
pekapeka
peke
penapena
pene
peneharatua
pepa
peparere
pepe
pepeke
pepepepe
pepetangi
pephu
pera
pere
pexepexe
pexi
pia
piapiri
piere
pigexi
pigoa
pihi
pikea
piki
pikipiki
piko
pikona
pikopokoxo
pini
pinipini
pipi
pipihoreko
pipini
pipipipi
pipiri
pipivare
piri
piria
piripiri
piriu
piro
pitipiti
pito
pixopixo
po
poa
poapatu
poara
poemahina
poepoe
poga
pogeha
poha
pohaha
pohi
pohutu
poihoiho
poki
pokino
poko
pokoga
pokohata
pokopoko
pokoxo
polis
polished
pona
poo
poopoo
poora
popo
popohaga
poporo
pora
poreko
porekoga
poremo
poriko
poro
poroporo
pororeko
porou
potahi
poto
potopoto
potu
potupotu
pou
pouhutuhututerevaimangaro
poukura
pouo
pouri
poxoi
poxopoxo
pruho
pu
pua
puaka
puapua
pue
puepue
puga
pugaehu
pugapuga
puhapuha
puhi
puhia
puhigaorogo
pukao
puke
pukou
puku
pukuine
pukupuku
pukuraga
puna
puneki
punene
puni
punipuni
punua
puo
puohirohiro
puoko
pupa
pupuhi
pupupa
pupura
pupurarautoa
pupure
pura
purapura
pure
pureireihua
pureva
purina
puru
putiti
putu
putuputu
puxa
puxapuxa
puxo
r
ra
raa
raau
rae
raga
ragaraga
ragi
rago
raha
rahai
rahau
rahi
rahu
rahuga
rahui
rai
rain
raituahea
raka
rakau
rake
rakei
rakerake
rakerakega
raki
rako
raku
rakuraku
rama
ran
rana
ranga
range
rangi
rano
ranu
rao
raohaga
raorao
rapa
rapahago
raparapa
raperape
rapo
rapu
rapurapu
rara
raraga
raraku
rarama
rarapa
rarape
rarata
raraxu
rarerare
rari
raro
rarua
rata
rato
rau
raua
rauhiva
rauoho
raup
raupa
rautu
rauuri
rava
ravaxa
rave
raverave
raxaraxa
raxaxu
raxe
raxi
raxiraxi
raxiraxiogo
raxu
raxuraxu
rega
regorego
rehe
reherehe
rehu
rei
reipa
reka
rekareka
reke
rekoreko
rekureku
remereme
remoremo
renga
renia
reo
reoreo
repa
repahoa
reperepe
repo
rere
rerepe
reretaura
rero
rerorero
reru
retoreto
retu
reva
revareva
rexe
rexerexe
rexo
ria
riamouga
riaria
rigarigapea
riha
rii
riki
rikiriki
riku
rima
rimu
rionou
ripoi
riri
rito
ritorito
riu
riva
rivariva
rivarivaga
rivarivahaga
rixo
ro
roa
roaroa
roaroatahaga
roe
rogo
rogorogo
rohirohi
rokia
romi
rona
roporo
rorau
rori
roria
roro
roroa
roroe
roroi
rorororo
rorua
roto
rotu
roturotu
rou
roxiroxi
roxou
ru
rua
ruaki
ruapapa
ruau
ruga
ruganui
ruhi
ruku
rukuruku
rumaruma
runa
runarame
runga
runu
runurunu
ruperoa
ruperupe
rurenga
ruru
ruruatikitehatu
ruruki
rutu
sont
ta
taake
taaku
taaria
taau
tae
taea
taerongoveteve
taga
tagapoki
tagata
tagataga
tagi
tagu
taha
tahaga
tahake
tahataha
tahatoi
tahau
tahe
taheta
tahi
tahina
tahitahi
tahito
tahoga
tahoi
tahri
tahu
tahua
tahuga
tahuri
tahuti
tai
taia
taiko
taina
taitai
taka
takaia
takapau
takapu
takataka
takatea
takatore
takaure
take
takeo
taki
takieve
takihi
takiri
takituxuhaho
takoua
takoxa
taku
takure
tama
tamahahine
tamahine
tamaiti
tamaroa
tamaru
tamu
tan
tana
tane
tangaire
tangaroa
tangata
tanku
tanoxa
tantan
tanu
tao
taokete
taomi
taoraha
tapa
tapaini
tapairu
tapamea
tapani
tapatea
tapau
tapo
tapona
taporo
tapu
tapuhavaoatua
tapui
tapuraki
taputapu
tara
tarai
tarake
tarakuero
taratara
taravi
tare
tari
tariga
taro
taropa
tarotaro
tarupu
taruriruri
tata
tatake
tataki
tataku
tatari
tatau
tatavenavena
tatou
tatu
tau
taua
tauake
tauaki
tauate
taueehu
taueve
taupoto
taura
taurari
tauroa
tauromi
tautau
tauuru
tauxa
tava
tavake
tavatava
taveke
tavi
taviri
tavraha
taxe
taxo
taxu
te
tea
teatea
techo
tehakarava
tehe
tehenua
tehi
teka
tekauha
teke
teketeke
teki
tekiteki
teko
temata
tenga
tere
tereheue
teri
teririkatea
tetea
teteme
tetere
tetu
tevaxe
tha
ti
tia
tiagi
tiahakaroaroa
tiaki
tiapito
tiatiamoana
tiena
tieuituiri
tigaxi
tigi
tigitigi
tihere
tiho
tika
tikaga
tikea
tikera
tiki
tikitehatu
tiko
tikoi
timeo
timo
tingahae
tini
tino
tiorei
tipitipihoe
tire
tirori
titaxa
titere
titeve
titi
titigi
titika
titiri
titiro
tito
titoke
tiuaa
tixaki
to
toa
toe
toega
toga
tohake
tohu
toka
tokaga
toke
tokea
tokerau
toki
tokorua
tokotoko
tokotokona
tokutoko
tomatou
tomaua
tomo
tomoga
ton
tona
tonga
tongarou
tono
tonokio
tooku
toona
topa
topatagi
toraua
toremo
toremuri
toretore
toretorekao
toritori
toro
toromaika
toromiro
toru
totara
totatou
totaua
toto
totohu
totoi
totope
totoro
tou
toua
tougakapitia
toutou
toxa
toxo
toxotoxo
toxou
tra
tu
tua
tuahane
tuahine
tuai
tuaivi
tuamigo
tuatea
tue
tuereheu
tugu
tugutugu
tuha
tuhaxa
tuhi
tuhiahaua
tuhinga
tui
tuitui
tuke
tuki
tukituki
tukouo
tuku
tukuga
tukutuku
tukuturi
tumu
tun
tuna
tunmakeuka
tunoko
tunu
tupa
tupatupa
tupu
tupuaki
tupufema
tupuga
tupuna
tureme
turi
turu
turuhirohero
turuki
turuturu
tutaxe
tute
tutu
tutuhi
tutuhinga
tutuki
tutuma
tuturi
tuu
tuuai
tuura
tuuria
tuvi
tuxa
tuxapapa
tuxu
tuxuaro
tuxuhaigoigo
tuxuhaviki
tuxutoga
tuxutuxu
tuxutuxuika
u
ua
uake
uapa
uaua
uaugai
ueue
ufi
uga
ugaiatu
ugarara
ugoto
uha
uhi
uhiuhi
uhoeve
ui
uiga
uira
uka
ukiuki
uku
ukukoko
uma
umaga
umika
umiki
umu
unahi
unhipura
unu
unuunu
upa
upaea
ura
uraura
ure
uretahiri
ureure
uri
uriuri
uru
uruara
uruga
uruharero
urumanu
uruuru
uruuruhoa
uta
uto
utu
utuahu
utuutu
uu
uuna
uutu
uxa
uxi
uxiga
uxu
v
vaai
vae
vaega
vaero
vaha
vahavaha
vahi
vahine
vai
vaiapuga
vaiarega
vaihi
vaiora
vairua
vaka
vakaivi
vakaure
vakavaka
vake
vakovako
vana
vanaga
vanavana
vanavanaga
varavara
vare
varegao
vari
varimariaria
varu
varua
varuaroto
vatavata
vava
vavae
vave
vavovavo
vaxe
vaxepau
vaxeraro
vaxeruga
vaxu
vehi
veke
vekeveke
vekuveku
veo
vera
verapaka
vere
verehiva
verepaka
veretaueve
verevere
veri
veriarahu
verigao
veriveri
vero
veroga
verovero
veta
veti
veu
veveke
vevete
veveveve
viaraupa
viatea
vihaviha
viri
viriviri
vivi
viviri
vixe
vixehoa
voko
vori
vovo
vovou
voxu
vuhi
xe
xuira
xuri
xuua